"""
Задание 5.
1) Создайте собственный класс-исключение, который должен проверять содержимое
списка на наличие только чисел.
Проверить работу исключения на реальном примере.
Необходимо запрашивать у пользователя данные и заполнять список только числами.
Класс-исключение должен контролировать типы данных элементов списка.
Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно,
пока пользователь сам не остановит работу скрипта, введя, например, команду
“stop”. При этом скрипт завершается, сформированный список с числами выводится
на экран.
Подсказка: для данного задания примем, что пользователь может вводить
 только числа и строки. При вводе пользователем очередного элемента необходимо
 реализовать проверку типа элемента и вносить его в список,
 только если введено число. Класс-исключение должен не позволить пользователю
 ввести текст (не число) и отобразить соответствующее сообщение.
 При этом работа скрипта не должна завершаться.
"""

class MyError(Exception):
    def __init__(self):
        pass


class TypeCheck:
    def __init__(self):
        self.my_list = []

    def check_value(self):
        global user_val
        while True:
            try:
                try:
                    user_val = int(input('Введите числа: '))
                    yes_no = input(f'Всё отлично, добавляем "{user_val}" в '
                                   f'список. Хотите продолжить? +/-: ').lower()
                    self.my_list.append(user_val)
                    if yes_no == '-':
                        print(self.my_list)
                        break
                except ValueError:
                    raise MyError
            except MyError:
                ex = input(f"Вы ввели не число! Хотите продолжить? "
                           f"y/n: ").lower()
                if ex == '-':
                    print(self.my_list)
                    break
                else:
                    self.check_value()


a = TypeCheck()
a.check_value()